# Задача 2: Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

# num = int(input("Введите трехзначное число "))

# sum = (num // 100) + ((num % 100 // 10)) + (num % 10)
# print("Сумма числа равна ", sum)


# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов.
# Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок,
# если известно, что Петя и Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

# *Пример:*

# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10


# s_num = int(input("Введите количество журавликов "))

# sum1 = (s_num/3)*2
# sum2 = (s_num/3)/2

# print("Количество журавликов Катя ", sum1)
# print("Количество журавликов Петя ", sum2)
# print("Количество журавликов Сережа ", sum2)
