# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой,
# а некоторые – гербом. Определите минимальное число монеток, которые нужно
# перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной.
# Выведите минимальное количество монет, которые нужно перевернуть

# n = int(input("Введите количество монет "))
# gerb_n = int(input("Введите количество монет с гербом "))
# resh_n = int(input("Введите количество монет с решкой "))

# if gerb_n == resh_n:
#     print("Минимальное количество монет для разворота ", gerb_n)
# elif gerb_n > resh_n:
#     print("Минимальное количество монет для разворота ", resh_n)
# elif gerb_n < resh_n:
#     print("Минимальное количество монет для разворота ", gerb_n)
